<a href="https://colab.research.google.com/github/Tsibulnikov/DA_and_ML_Python/blob/master/HW1_N8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Задание 8

- Найдите максимальную разницу между парой из следующих значений (*):
            - Медиана суммы транзакций
            - Медиана суммы транзакций по тем строкам, которые ни в одном из своих столбцов не содержат пустые значения
            - Медиана суммы упорядоченного по столбцу amount датафрейма transactions, у которого удалены дублирующиеся по столбцам [mcc_code, tr_type] строки, причём при удалении соответстующих дублей остаются только последние из дублирующихся строк (keep='last')
            
            
Выведите ответ в виде вещественного числа, округлённого до двух знаков после запятой, отделив дробную часть точкой в формате "123.45"


Пояснения:
    
(*) Для вычисления максимальной разницы между значениями списка можно использовать функцию np.ptp

(**) Если в результате получились значения [1,3,5], то макимальная разница между ними 4 == 5-1.

In [3]:
import pandas as pd

In [7]:
df = pd.read_csv(filepath_or_buffer='/transactions.csv', sep=',')
df

        customer_id   tr_datetime  mcc_code  tr_type    amount term_id
0          39026145    0 10:23:26      4814     1030  -2245.92     NaN
1          39026145    1 10:19:29      6011     7010  56147.89     NaN
2          39026145    1 10:20:56      4829     2330 -56147.89     NaN
3          39026145    1 10:39:54      5499     1010  -1392.47     NaN
4          39026145    2 15:33:42      5499     1010   -920.83     NaN
...             ...           ...       ...      ...       ...     ...
318665     22771802  312 16:28:18      5499     1010  -2223.46  382372
318666     22771802  312 16:31:05      5499     1010  -1459.85  702147
318667     22771802  312 18:00:00      5411     1010 -11431.71  224356
318668     22771802  313 16:19:16      5499     1010  -2369.44  382372
318669     22771802  313 16:21:35      5499      101       NaN     NaN

[318670 rows x 6 columns]

In [9]:
df_sum = df.groupby(['customer_id']).agg(sum)
df_sum

             mcc_code  tr_type       amount
customer_id
115617         549584   146260 -10978011.60
186730        1257218   633277  -2579583.44
302489        7699359  1997355  -8234657.18
600423        1419165   387220  -4089070.22
611788         712883   327450  -3442301.18
...               ...      ...          ...
99540926       789859   681020   1038264.42
99699527      5122580  1375300 -17050839.08
99729098      1674177   542380  -5710223.01
99815733       358250   178175 -10945128.70
99953525       978465   378250  -4914623.05

[713 rows x 3 columns]

In [12]:
ans1 = df_sum.amount.median()
ans1

-8864863.579999998

In [15]:
df_drop = df.dropna()
df_drop

        customer_id   tr_datetime  mcc_code  tr_type    amount term_id
377        39026145  208 14:18:12      5499     1010  -7254.31  453799
378        39026145  208 14:24:23      5499     1010  -1392.47  453306
379        39026145  209 15:09:16      5499     1010  -2852.31  453306
380        39026145  209 15:13:51      5499     1010   -853.45  058435
381        39026145  209 15:13:17      5499     1010  -1410.44  058435
...             ...           ...       ...      ...       ...     ...
318664     22771802  312 16:26:30      5499     1010  -1931.49  702148
318665     22771802  312 16:28:18      5499     1010  -2223.46  382372
318666     22771802  312 16:31:05      5499     1010  -1459.85  702147
318667     22771802  312 18:00:00      5411     1010 -11431.71  224356
318668     22771802  313 16:19:16      5499     1010  -2369.44  382372

[184514 rows x 6 columns]

In [17]:
ans2 = df_drop.groupby('customer_id').agg(sum).amount.median()
ans2

-4594165.869999998

In [18]:
df_drop_dupl = df.drop_duplicates(subset=['mcc_code', 'tr_type'], keep='last')
df_drop_dupl

        customer_id   tr_datetime  mcc_code  tr_type     amount   term_id
313        39026145  178 00:00:00      5331     6110     449.18       NaN
3727        1585299  433 08:00:27      5532     1100 -655807.41    759823
6190        3765322  118 10:48:43      5949     1100 -437279.80       NaN
21915      19513764  397 00:00:00      7932     1110  -11229.58  29198777
27461      26847016  122 00:00:00      5946     1100   -3270.50       NaN
...             ...           ...       ...      ...        ...       ...
318659     22771802  311 14:16:37      5411     1110   -5807.94  22400580
318662     22771802  312 00:00:00      7399     1200   -6266.11       NaN
318667     22771802  312 18:00:00      5411     1010  -11431.71    224356
318668     22771802  313 16:19:16      5499     1010   -2369.44    382372
318669     22771802  313 16:21:35      5499      101        NaN       NaN

[703 rows x 6 columns]

In [20]:
ans3 = df_drop_dupl.groupby(['customer_id']).agg(sum).amount.median()
ans3

-37057.604999999996

In [24]:
import numpy as np
np.ptp(np.array([ans1,ans2,ans3]))

8827805.974999998

In [ ]:
#Ответ 8827805.97